API/SoapRequest/SoapQueryRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:typ="http://www.altechisis.com/iCAP/Types">
    <soap:Header/>
    <soap:Body>
        <typ:queryRequest>
            <!--Optional:-->
            <typ:key>
                <!--Optional:-->
                <typ:originId>TC</typ:originId>
                <!--Optional:-->
                <typ:username>AUTOEIS</typ:username>
                <!--Optional:-->
                <typ:key>autoeis071615160503201</typ:key>
            </typ:key>
            <!--Optional:-->
            <typ:userId>?</typ:userId>
            <typ:querySelector>QRYPRF</typ:querySelector>
            <!--Zero or more repetitions:-->
            <typ:attributes>
                <!--Optional:-->
                <typ:attributeName>ICCID</typ:attributeName>
                <!--Optional:-->
                <typ:attributeValue>89900000000001701825</typ:attributeValue>
            </typ:attributes>
            <!--Optional:-->
            <typ:icapId>?</typ:icapId>
        </typ:queryRequest>
    </soap:Body>
</soap:Envelope>